app/controllers/track_locations_controller.rb

	def get_locations
  		center = {}
  		center[:lat] = params[:lat].to_f
  		center[:lng] = params[:lng].to_f
  		radius = params[:radius].to_i

  		locations_within_radius = []

  		locations_within_radius = MobileFoodFacilityPermit.all
---
SELECT "mobile_food_facility_permits".* FROM "mobile_food_facility_permits"